Tekla.Structures.ModelInternal.SurfaceObjectCreator
This class creates surface objects by using model side logic.

Tekla.Structures.ModelInternal.SurfaceObjectCreator.CreateByFace(System.Int32,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Creates a surface object by a model object's face.
objectId:
The identifier of the model object which the surface is created for
hitPoint:
The hit point on the face of the model object.
faceNormal: The face normal
Returns: The created surface object; or null of the operation failed.

Tekla.Structures.ModelInternal.SurfaceObjectCreator.CreateByFace(System.Int32,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.String,System.String)
Creates a surface object by a model object's face.
objectId:
The identifier of the model object which the surface is created for
hitPoint:
The hit point on the face of the model object.
faceNormal: The face normal
name: The name
surfaceClass: The class
Returns: The created surface object; or null of the operation failed.

Tekla.Structures.ModelInternal.SurfaceObjectCreator.CreateRebarLegSurfaceObjectByFace(System.Int32,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Int32)
Creates a rebar leg surface object by a model object's face.
objectId: The identifier of the model object which the surface is created for.
hitPoint: The hit point on the face of the model object.
faceNormal: The face normal.
rebarSetId: The parent rebar set ID.
Returns: The created surface object, or null if the operation failed.

Tekla.Structures.ModelInternal.SurfaceObjectCreator.InitDotSurfaceObject
Initialize dotPolymesh object.
Returns: dotPolymesh object.

Tekla.Structures.ModelInternal.SurfaceObjectCreator.GetPoint(Tekla.Structures.Geometry3d.Vector)
Convert Vector to dotPoint.
inPoint: Input point
Returns: dotPoint object.

Tekla.Structures.ModelInternal.SurfaceObjectCreator.GetSurfaceObject(System.Int32)
Convert Vector to dotPoint.
id: surface object
Returns: surface object.